n = 4  # Висота піраміди

num = 1  # Початкове число для виведення
for i in range(1, n + 1):  # Зовнішній цикл по рядках
    for j in range(i):  # Внутрішній цикл по кількості елементів у рядку
        print(num, end=" ")  # Виводимо поточне значення num
        num += 1  # Збільшуємо num на 1
    print()  # Перехід на новий рядок після завершення кожного рядка

num = 10  # Початкове число для зворотного порядку
for i in range(n, 0, -1):  # Зовнішній цикл по рядках (від n до 1)
    for j in range(i):  # Внутрішній цикл по кількості елементів у рядку
        print(num, end=" ")  # Виводимо поточне значення num у зворотному порядку
        num -= 1  # Зменшуємо num на 1
    print()  # Перехід на новий рядок після завершення кожного рядка
